Repository: TrellixVulnTeam/GOTbuild_E0PQ
Catalog: addons/script.ratingupdate/resources/language/*/strings.po
Languages: italian

# Addon Summary
source: Keep up to date the ratings and the Top250 of your all Movies and TVShows.
italian: Tieni aggiornate le valutazioni e la Top250 di tutti i tuoi Film e Serie TV.

# Addon Description
source: Would you like to update the ratings and the Top250 of all your Movies and TVShows without rescrape all data? This script allow you to update the ratings of all your Movies and TVShows in one shot and keep updated the IMDb Top250. To avoid mistakes will be used the IMDb ID and the database will be updated only if necessary. Will be processed the scores, the number of users who have voted, the MPAA and the Top250 of course.
italian: Desideri aggiornare le valutazioni e la Top250 di tutti i tuoi Film e Serie TV senza fare il rescrape tutti i dati? Questo script consente di aggiornare le valutazioni di tutti i tuoi Film e Serie TV in un solo colpo e mantiene aggiornata la Top250 di IMDb. Per evitare errori verrà utilizzato l'ID di IMDb e il database verrà aggiornato solo se necessario. Saranno aggiornati i punteggi, il numero di utenti che hanno votato, la valutazione MPAA e la Top250, naturalmente.

# Addon Disclaimer
source: Works only if you have the IMDb IDs in your database.
italian: Funziona solo se gli ID IMDb sono presenti nel database.

# #32102
source: Movies
italian: Film

# #32103
source: TV Shows
italian: Serie TV

# #32104
source: Exit
italian: Esci

# #32105
source: Missing
italian: Mancanti

# #32106
source: Checks the Top250 list of all your movies
italian: Controlla la lista Top250 di tutti i tuoi film

# #32107
source: Checks the ratings of all your movies
italian: Controlla le valutazioni di tutti i tuoi film

# #32108
source: Checks the ratings of all your tv shows
italian: Controlla le valutazioni di tutte le tue Serie TV

# #32109
source: Look xbmc.log file to see what has been done
italian: Guarda il file xbmc.log per vedere cosa è stato fatto

# #32110
source: Yes
italian: Si

# #32112
source: Resume
italian: Riprendi

# #32113
source: Not Resume
italian: Non Riprendere

# #32200
source: The previous scraping was interrupted
italian: La scraping precedente era stato interrotto

# #32201
source: Do you want to resume?
italian: Vuoi riprendere?

# #32202
source: You can resume from where it was interrupted
italian: È possibile riprendere da dove ci si è fermati

# #32250
source: Sending query to the IMDb site, please wait ...
italian: Invio della query al sito IMDb, attendere prego ...

# #32251
source: Complete
italian: Completo

# #32252
source: Incomplete
italian: Incompleto

# #32253
source: Never Checked
italian: Mai Controllato

# #32254
source: Started updating for the Top250
italian: Avviato aggiornamento per la Top250

# #32255
source: Started updating for the Movies
italian: Avviato aggiornamento per i Film

# #32256
source: Started updating for the TV Shows
italian: Avviato aggiornamento per le Serie TV

# #32300
source: Imports the current Top250 list
italian: Importo l'attuale lista dei Top250

# #32301
source: %s: was added at the position %s
italian: %s: inserito nella posizione %s

# #32302
source: %s: the old position was %s the new position is %s
italian: %s: la vecchia posizione era %s la nuova posizione è %s

# #32303
source: %s: there's no need any updates
italian: %s: non è necessario nessun aggiornamento

# #32304
source: %s: was removed because no more in the Top250
italian: %s: è stato rimosso perché non più nella Top250

# #32305
source: %s updated - %s added - %s removed|Now the movies in your Top250 are %s
italian: %s aggiornati - %s aggiunti - %s rimossi|Ora i film nella tua Top250 sono %s

# #32306
source: List of the missing Top250
italian: Elenco dei Top250 mancanti

# #32400
source: Movies Top250 summary
italian: Riepilogo Film per la Top250

# #32401
source: Movies ratings summary
italian: Riepilogo valutazioni Film

# #32402
source: TV Shows ratings summary
italian: Riepilogo valutazioni Serie TV

# #32403
source: Searching for
italian: Ricerca di

# #32450
source: Current TV Show:
italian: Serie TV corrente:

# #32451
source: Which is correct? (ESC to skip)
italian: Qual è giusto? (ESC per saltare)

# #32452
source: If not in list starts the virtual keyboard ...
italian: Se non è nella lista avvia la tastiera virtuale ...

# #32453
source: was skipped by the user
italian: è stato saltato da parte dell'utente

# #32454
source: was added in ruDatabase as %s
italian: è stato aggiunto nel ruDatabase come %s

# #32455
source: was changed in ruDatabase as %s
italian: è stato cambiato nel ruDatabase come %s

# #32456
source: was skipped by the system
italian: è stato saltato da parte del sistema

# #32457
source: Set this TV Show to skipping always ...
italian: Imposta questa Serie TV su salta sempre ...

# #32458
source: Skip Always
italian: Salta Sempre

# #32459
source: Is set to skipping always
italian: È impostato su salta sempre

# #32500
source: The new Rating is %s with %s voters
italian: La nuova valutazione è %s con %s votanti

# #32501
source: and the new MPAA is %s
italian: e il nuovo MPAA è %s

# #32502
source: No new Rating
italian: Nessuna nuova valutazione

# #32503
source: and no new MPAA
italian: e nessun nuovo MPAA

# #32504
source: %s of %s were updated
italian: %s di %s sono stati aggiornati

# #32550
source: Manages TV Shows IMDb ID
italian: Gestisci gli ID IMDb delle Serie TV

# #32601
source: Error
italian: Errore

# #32602
source: Abort
italian: Abortito

# #32603
source: The scraping was canceled by the user
italian: Lo scraping è stato annullato dall'utente

# #32604
source: The JSON query is failed, sorry
italian: La query JSON è fallita, mi dispiace

# #32605
source: The query to IMDb site is failed, sorry
italian: La query al sito IMDb è fallita, mi dispiace

# #32606
source: The IMDb ID was not found for this movie
italian: L'ID IMDb non è stato trovato per questo film

# #32607
source: The query to the database is failed, sorry
italian: La query al database è fallita, mi dispiace

# #32608
source: The php-cgi binary wasn't found in your system
italian: Il binario php-cgi non è stato trovato nel tuo sistema

# #32609
source: Please see the README file and install it
italian: Si prega di consultare il file README e installarlo

# #32610
source: Creates and populates the ruDatabase.db
italian: Creazione e popolamento del ruDatabase.db

# #32611
source: Current ruDatabase is set to the v%s - There's need an update
italian: La versione corrente del ruDatabase è v%s - C'è bisogno di un aggiornamento

# #32612
source: There's a problem with your database settings
italian: C'è un problema con le impostazioni del database

# #32613
source: Please check if the database settings are correct
italian: Si prega di controllare se le impostazioni del database sono corrette

# #32650
source: Clean
italian: Pulisci

# #32651
source: Click the selected TV Show to do search again
italian: Clicca sulla Serie TV per fare una nuova ricerca

# #32652
source: "Clean" to delete the nonexistent TV Shows
italian: "Pulisci" per eliminare le Serie TV inesistenti

# #32653
source: The clean was completed
italian: La pulizia è stata completata

# #32654
source: %s nonexistent TV Shows were removed
italian: %s Serie TV inesistenti sono state rimosse

# #32655
source: Service started and scheduled for every %s at %s
italian: Servizio avviato e programmato per ogni %s alle ore %s

# #32801
source: General
italian: Generale

# #32802
source: General options
italian: Opzioni generali

# #32803
source: Folder path for the php-cgi binary
italian: Percorso della cartella per il binario php-cgi

# #32804
source: Folder path for the text file of the movies missing in the Top250
italian: Percorso della cartella per il file di testo dei film mancanti nella Top250

# #32805
source: What do you want to update?
italian: Cosa vuoi aggiornare?

# #32806
source: Activate script for the Top250
italian: Attiva lo script per la Top250

# #32807
source: Activate script for the Movies (doesn't influence the Single Mode)
italian: Attiva lo script per i Film (non influenza la Modalità Singola)

# #32808
source: Activate script for the TV Shows (doesn't influence the Single Mode)
italian: Attiva lo script per le Serie TV (non influenza la Modalità Singola)

# #32809
source: Managing IMDb ID (TV Shows)
italian: Gestione degli ID IMDb (Serie TV)

# #32810
source: Opens module to manage the IMDb of the TV Shows in the ruDatabase
italian: Apri il modulo per gestire gli ID di IMDb delle Serie TV nel ruDatabase

# #32812
source: MPAA Ratings options
italian: Opzioni valutazioni MPAA

# #32813
source: Also update the MPAA Rating
italian: Aggiorna anche la MPAA

# #32814
source: Type the text prefix for the MPAA ratings (Movies)
italian: Digita il prefisso di testo per le valutazioni MPAA (Films)

# #32815
source: Type the text prefix for the MPAA ratings (TV Shows)
italian: Digita il prefisso di testo per le valutazioni MPAA (Serie TV)

# #32816
source: Select the country to which you want to get the MPAA
italian: Selezionare il Paese del quale si vuole ottenere la MPAA

# #32817
source: Do you want to update the MPAA with reason (only for the movies)?
italian: Vuoi aggiornare la MPAA con la ragione (solo per i film)?

# #32819
source: Background Mode options
italian: Opzioni modalità Background

# #32820
source: Run in Background Mode (only notifications, no gui)
italian: Eseguire in Modalità Background (solo notifiche, senza gui)

# #32821
source: User
italian: Utente

# #32822
source: Service
italian: Servizio

# #32823
source: How the script must answer in case of resume requests?
italian: Come deve rispondere lo script in caso di richieste di ripresa?

# #32824
source: Choose the weekday on which to run the script
italian: Scegli il giorno della settimana in cui eseguire lo script

# #32825
source: Choose the delay time (minutes) to run, after that XBMC is started
italian: Scegli il tempo di ritardo (minuti) per eseguire, dopo l'avvio di XBMC

# #32826
source: Hides any progress bar, uses only the notifications
italian: Nascondi ogni barra di avanzamento, utilizza solo le notifiche

# #32827
source: Monday
italian: Lunedì

# #32828
source: Tuesday
italian: Martedì

# #32829
source: Wednesday
italian: Mercoledì

# #32830
source: Thursday
italian: Giovedì

# #32831
source: Friday
italian: Venerdì

# #32832
source: Saturday
italian: Sabato

# #32833
source: Sunday
italian: Domenica

# #32851
source: Modding options
italian: Opzioni di modding

# #32852
source: Do you want to use RAW queries to update the database (not in Single Mode)?
italian: Vuoi utilizzare le RAW queries per aggiornare il database (non in Modalità Singola)?

# #32853
source: Are you using a MySql database?
italian: Stai usando un database MySql?

# #32854
source: Type the Name of the database
italian: Digita il Nome del database

# #32855
source: Type your MySql Host
italian: Digita l'Host del tuo MySql

# #32856
source: Type your MySql Username
italian: Digita il Nome Utente del tuo MySql

# #32857
source: Type your MySql Password
italian: Digita la Password del tuo MySql

# #32901
source: Credits
italian: Crediti

# #32903
source: The best way to update ratings of your Movies TV Shows
italian: Il modo migliore per aggiornare le valutazioni dei tuoi Film Serie TV

# #32906
source: Add-on author:
italian: Autore add-on:

# #32908
source: For bugs, requests or general questions visit the Rating Update thread on the XBMC forum
italian: Per bug, richieste o domande in generale visita il thread Rating Update sul forum di XBMC

# #32909
source: Thanks to:
italian: Grazie a:

# #32910
source: IzzySoft Projects for the greatest PHP Class IMDBPHP
italian: IzzySoft Projects per la magnifica classe PHP IMDBPHP
